from Spiders.lianjia.common.find_house_func import find_house


school = "1-成都市百草园小学"
streets = ["百锦路555号", "太平园西路", "聚龙路", "聚荟街", "聚萃街", "聚贤街", "兆景路",
           "武侯大道顺江段76号", "武侯大道顺江段92号", "保利花园一期", "保利花园二期",
           "满园春", "华宇静苑", "华宇楠苑", "置信丽都花园城", "诗锦苑", "珑熙郡"]
find_house(school, streets)

'''
school = "1-成都市盐道街小学"
streets = ["盐道街", "指挥街", "人民南路二段", "滨江西路", "滨江中路", "上南大街", "中南大街",
           "下南大街59号", "红照壁", "纯化街", "金字街", "新光华街", "红星中路2号", "锦兴路",
           "西丁字街", "状元街", "中莲池正街", "中莲池横街", "东丁字街", "横丁字街", "自强街",
           "前卫街", "新开街", "南府街", "东府街", "烟袋巷", "东桂街", "光华街", "金子街",
           "大塘坎街", "安居巷", "飞龙巷"]
find_house(school, streets)'''


'''
school = "1-成都市草堂小学"
streets = ["浣花北路", "浣花南路", "青羊正街", "青羊横街", "一环路西一段", "一环路西二段", "青羊上街",
           "望仙场", "草堂东路", "大石西路", "百卉路", "浣花滨河路", "科联街", "百花西路",
           "浣锦路", "浣锦滨河路", "百花潭路"]
find_house(school, streets)


school = "1-成都市实验小学"
streets = ["西御河沿街", "西二巷", "九思巷", "人民中路一段", "西玉龙街南侧", "上升街", "东二巷",
           "东御河沿街", "东华门街", "上翔街", "体育场路"]
find_house(school, streets)


school = "1-成都市泡桐树小学"
streets = ["多子巷", "泡桐树街", "商业街", "实业街", "支矶石街"]
find_house(school, streets)


school = "1-成都师范附属小学"
streets = ["染坊街", "梨花街", "锦江里", "锦江路", "大业路", "青莲巷", "老半边街",
           "青石桥北街", "向阳街", "学道街", "南新街", "中新街", "中新横街", "古卧龙桥街",
           "走马街", "东大街上东大街段", "粪草湖", "光大巷", "保全巷", "斧头巷", "丝棉街",
           "红星路四段", "青石桥中街", "青石桥南街", "新半边街", "西龙须巷", "余庆桥", "安居巷", "向荣桥",
           "桂花街", "治平街", "张化街", "青平巷", "公平巷", "锦兴路", "老古巷", "城守东大街", "督院街",
           "大有巷", "人民东路", "东御街", "东华正街", "东华门街", "东华南街", "宾盛巷", "下西顺城街"]
find_house(school, streets)'''


'''school = "成都市泡桐树小学西区分校"
streets = ["瑞南街", "瑞联路", "东坡路", "东坡北一路", "东坡北二路", "东坡北三路", "清影路",
           "绿杨路", "玉宇路", "琼楼路", "瑞星路", "春晓路"]
find_house(school, streets)'''


'''school = "成都市新华路小学"
streets = ["育婴堂街", "北书院街", "七家巷", "方正东街", "玉沙路", "狮马路", "小关庙街",
           "小关庙后街", "富德里", "马镇街", "东城拐街", "石马巷", "莹华寺街", "福德街",
           "太升北路", "狮子巷", "大安东路", "东通顺街", "玉皇观街", "红星路一段", "小关庙巷"]
find_house(school, streets)'''


'''school = "成都市龙江路小学"
streets = ["大学路", "光明路", "十七巷", "临江路", "南虹路", "临江中路", "华西医大校区宿舍",
           "四川省寄生虫研究所宿舍", "成都市商行职工宿舍", "四川省国税局宿舍", "成都汽车运输公司宿舍",
           "成都化工研究所职工宿舍", "市中医研究所宿舍"]
find_house(school, streets)'''
